

"""
Користувач має пошту у домені @kpi.ua. Він купляє товари вказуючи назву та ціну.

Формати даних:

    пошта: перша літера англійської абетки у нижньому регістрі, далі стоїть крапка потім прізвище студента.

    назва товару : не більше 10 літер англійської абетки у нижньому регістрі

    ціна товару: додатне дійсне число з двома знаками після десяткової коми

"""


#    Сформувати структуру датасету для дного користувача.


dataset = \
{
    "b.bob@kpi.ua":{
                    "apple":[3.00, 15.50],
                    "tea": [12.00, 50.00, 40.00],
                    },

}







